# Задание 1
# Напишите функцию, которая отображает на экран
# форматированный текст, указанный ниже:
# “Don't compare yourself with anyone in this world…
# if you do so, you are insulting yourself.”
# Bill Gates

def text():
    t="""\"Don't compare yourself with anyone in this world…
if you do so, you are insulting yourself.\"
            \t\t\t\t\t\t\t\tBill Gates"""
    return t

print (text())